<!--
 * @Author: sitao
 * @Date: 2020-12-29 09:57:22
 * @LastEditors: sitao
 * @LastEditTime: 2021-01-20 16:03:33
-->
<template>
  <div class="main">
    <StepPanle :stepData="stepData"></StepPanle>
  </div>
</template>

<script>
import StepPanle from './stepPanle.vue'
export default {
  name: 'Work',
  components:{
    StepPanle
  },
  data() { 
    return {
      stepData:[
        {
          title:'积分落户',
          desc:'有时我们觉得别人误会了自己，其实是我们误会了自己,有时我们觉得别人误会了自己，其实是我们误会了自，有时我们觉得别人误会了自己，其实是我们误会了自己,有时我们觉得别人误会了自己，其实是我们误会了自，有时我们觉得别人误会了自己，其实是我们误会了自己,有时我们觉得别人误会了自己，其实是我们误会了自，有时我们觉得别人误会了自己，其实是我们误会了自己,有时我们觉得别人误会了自己，其实是我们误会了自，有时我们觉得别人误会了自己，其实是我们误会了自己,有时我们觉得别人误会了自己，其实是我们误会了自，有时我们觉得别人误会了自己，其实是我们误会了自己,有时我们觉得别人误会了自己，其实是我们误会了自，有时我们觉得别人误会了自己，其实是我们误会了自己,有时我们觉得别人误会了自己，其实是我们误会了自，有时我们觉得别人误会了自己，其实是我们误会了自己,有时我们觉得别人误会了自己，其实是我们误会了自'
        },
        {
          title:'积分落户',
          desc:'有时我们觉得别人误会了自己，其实是我们误会了自己,有时我们觉得别人误会了自己，其实是我们误会了自'
        },
        {
          title:'积分落户',
          desc:'有时我们觉得别人误会了自己，其实是我们误会了自己,有时我们觉得别人误会了自己，其实是我们误会了自'
        },
        {
          title:'积分落户',
          desc:'有时我们觉得别人误会了自己，其实是我们误会了自己,有时我们觉得别人误会了自己，其实是我们误会了自，有时我们觉得别人误会了自己，其实是我们误会了自己,有时我们觉得别人误会了自己，其实是我们误会了自，有时我们觉得别人误会了自己，其实是我们误会了自己,有时我们觉得别人误会了自己，其实是我们误会了自，有时我们觉得别人误会了自己，其实是我们误会了自己,有时我们觉得别人误会了自己，其实是我们误会了自，有时我们觉得别人误会了自己，其实是我们误会了自己,有时我们觉得别人误会了自己，其实是我们误会了自，有时我们觉得别人误会了自己，其实是我们误会了自己,有时我们觉得别人误会了自己，其实是我们误会了自，有时我们觉得别人误会了自己，其实是我们误会了自己,有时我们觉得别人误会了自己，其实是我们误会了自，有时我们觉得别人误会了自己，其实是我们误会了自己,有时我们觉得别人误会了自己，其实是我们误会了自'
        },
        {
          title:'积分落户',
          desc:'有时我们觉得别人误会了自己，其实是我们误会了自己,有时我们觉得别人误会了自己，其实是我们误会了自'
        },
        {
          title:'积分落户',
          desc:'有时我们觉得别人误会了自己，其实是我们误会了自己,有时我们觉得别人误会了自己，其实是我们误会了自'
        }
      ]
    }
  }
 }
</script>

<style lang="scss" >
  .main{
    background-color: #fff;
    height: 1000px;
    padding: 20px;
    border-radius: 5px;
  }
</style>